/* Κλάσεις και Δείκτες */
/* Άσκηση για πειραματισμό με τους δείκτες (Διπλοί Δείκτες)*/
/*
Δηλώστε μια ακέραια μεταβλητή x
Τυπώστε τη τιμή και τη διεύθυνση της

Δηλώστε έναν δείκτη σε ακέραιο p
Θέστε τον δείκτη να δείχνει στην x
Τυπώστε τη τιμή και τη διεύθυνση του
Τυπώστε τη τιμή της x μέσω του p

Δηλώστε έναν δείκτη σε δείκτη σε ακέραιο με όνομα pp
Θέστε τον δείκτη να δείχνει στον p
Τυπώστε τη τιμή και τη διεύθυνση του
Τυπώστε την τιμή του x, μέσω του pp
Τυπώστε τη τιμή του p, μέσω του pp
*/

#include <iostream>
using namespace std;

int main()
{
  int x = 5;
  int *p;
  int **pp;

  p = &x;
  pp  = &p;

  cout << "x=" << x << " (Address:" << &x << ")" << endl;
  cout << "p=" << p << " (Address:" << &p << ")" << endl;
  cout << "x=(*p)=" << *p <<endl;

  cout << "pp=" << pp << " (Address:" << &pp << ")" << endl;
  cout << "x=(**pp)=" << **pp << endl;
  cout << "p=(*pp)=" << *pp << endl;

  return 0;
}
