/* ΚΛΑΣΕΙΣ & ΔΕΙΚΤΕΣ */

/*
*******************Στατική και Δυναμική δέσμευση μνήμης***********************
Στατική Δέσμευση Μνήμης:
1) Είναι γνωστός εκ των προτέρων ο χώρος που απαιτείται για τα στιγμιότυπα/
αντικείμενα της κλάσης.
πχ. δηλώνουμε έναν πίνακα 10 θέσεων
2) Οι τοπικές μεταβλητές αποθηκεύονται στον χώρο της συνάρτησης. Κάθε συνάρτηση
έχει το δικό της χώρο μνήμης με τις δικές της μεταβλητές. (στοίβα/stack)

Δυναμική Δέσμευση Μνήμης:
1) Ο χώρος που θα απαιτείται δεν είναι γνωστός. Αποφασίζεται κατά το χρόνο
εκτέλεσης του προγράμματος. πχ. Ο χρήστης ορίζει πόσες θέσεις θα έχει ένας
πίνακας. Δεν γνωρίζουμε πόσο χώρο θα απαιτήσει το πρόγραμμα κατά την εκτέλεση
του.
2) Γίνεται δυναμική δέσμευση του χώρου μνήμης ο οποίος είναι κοινός για όλες
τις συναρτήσεις. (σωρός/heap)

Ένα αντικείμενο αποθηκέυεται στη μνήμη με στατική μέθοδο.
Τα μέλη του βρίσκονται σε διαδοχικές θέσεις μνήμης. Προσοχή! οι μέθοδοι
βρίσκονται σε άλλο χώρο (είναι κοινές για όλα τα αντικείμενα της κλάσης).

Ο τελεστής sizeof μπορεί να χρησιμοποιηθεί για να μετρήσουμε το πλήθος των
bytes που χρησιμοποιεί ένα αντικείμενο.

*/


#include <iostream>
using namespace std;

class dummy{
public:
  int x;
  int y;
};

int main()
{
  dummy ob;
  ob.x=3;
  ob.y=5;

  cout<<sizeof ob<<endl; // επιστρέφει 8. 4 για κάθε int.

  return 0;

}
