/* Σχεδιάστε έναν πίνακα με τις ακόλουθες τιμές
[5 9 7 1 2 4].
Βρείτε τη μικρότερη βαθμολογία.
Βρείτε και τη θέση της μικρότερης τιμής.
Βρείτε τα στοιχεία του πίνακα που η τιμή τους είναι μικρότερη από τον μέσου όρου του πίνακα.
*/
#include <stdio.h>

main()
{
    //Σχεδιάστε έναν πίνακα με τις ακόλουθες τιμές [5 9 7 1 2 4]
    int A[]={5,9,7,1,2,4};
    int i, min,pos;
    int sum;
    float avg;

    // Βρείτε τη μικρότερη βαθμολογία.
    min=A[0];
    for (i=1;i<6;i++)
    {
      if (A[i]<min)

        min=A[i];
        pos=i; // Βρείτε και τη θέση της μικρότερης τιμής.
    }

    // Βρείτε τα στοιχεία του πίνακα που η τιμή τους είναι μικρότερη από τον μέσου όρου του πίνακα.
    sum = 0 ;
    for (i=0; i<6; i++)
    {
        sum+=A[i];
    }

    avg=sum/6.0;

    for (i=0; i<6 ; i++)
        if (A[i]<avg)
        printf("%d %d", A[i], i+1); // Το i ορίζει και τη θέση του πίνακα, αφού έχουν ίδια αρίθμιση

    // Σειριακή Αναζήτηση (Sequential Search)
    // Ορίζουμε ένα κλειδί key και ψάχνουμε σειριακά όλο τον πίνακα. Διατρέχει τα στοιχεία του πίνακα ένα προς ένα.

    int key;
    int f; // Για το ενδεχόμενο που δεν βρει κάποιο κλειδί
    f=0;
    printf("Δώσε το κλειδί \n");
    scanf("%d", &key);
    for (i=0;i<6;i++)
    {
       if (A[i]==key)
       {
           f=1;
           break;
       }
    }
    if (f==0)
    {
        printf("Not found\n");
    }
    else
        printf("Found at position %d\n", i+1);

}




