/* Τελεστές και Δομή Ελέγχου */
/*
ΔΟΜΗ ΕΛΕΓΧΟΥ if...else if (διαδοχικές εντολές συνθήκης)

Η σύνταξη διαδοχικών ελέγχων γίνεται με διαδοχικές if ...else if...else if.

πχ.
if(πρώτη συνθήκη)
{
  εντολέςΑ;
}
else if(δεύτερη συνθήκη) - έχει αποτύχει η πρώτη
{
  εντολέςΒ;
}
else // έχουν αποτύχει και οι δυο προηγούμενες συνθήκες.
{
  εντολέςΓ;
}

Στην ουσία το if ..else if.. είναι μια συντομογραφία των nested if.

*/

#include <stdio.h>

int main()
{
  int x;
  int y;

  printf("Δώσε τον ακέραιο x: ");
  scanf("%d",&x);
  printf("Δώσε τον ακέραιο y: ");
  scanf("%d",&y);

  if(x<y)
    printf("Ισχύει x<y");
  else if(x==y)
      printf("Ισχύει x=y");
  else
      printf("Ισχύει x>y");

return 0;
}
