/*Γράψτε ένα πρόγραμμα το οποίο
Να δέχεται από τον χρήστη σαν είσοδο έναν ακέραιο αριθμό, που θα απεικονίζει
δευτερόλεπτα.
Να υπολογίζει πόσες ώρες, λεπτά και δευτερόλεπτα είναι η είσοδος του χρήστη.
Hint: Χρησιμοποιείστε τους τελεστές / και % για το επιθυμητό αποτέλεσμα.*/

#include <stdio.h>

int main()
{
  int x, hours, mins, secs;

  printf("Δώσε το πλήθος των δευτερολέπτων: ");
  scanf("%d",&x);

  hours = x/3600;

  x = x%3600; /*Τα λεπτά τα υπολογίζουμε από το υπόλοιπο της διαίρεσης
                με τις ώρες*/
  mins = x/60;

  secs = x%60; /* τα δευτερόλεπτα είναι το υπόλοιπο της διαίρεσης με το 60*/

  printf("Ώρες: %d\n",hours);
  printf("Λεπτά: %d\n",mins);
  printf("Δευτερόπλεπτα: %d",secs);

return 0;
}
