/* Τελεστές και Δομή Ελέγχου */
/*
ΔΟΜΗ ΕΛΕΓΧΟΥ if...else if (Τριαδικός Τελεστής  :? )

Στην ουσία μια συντομογραφία της if...else

*/

#include <stdio.h>

int main()
{
  int x,y,z;

  // *****Πρώτος τρόπος με if...else*****
  x=0 ; y=1;
  if(x<y)
    z=0;
  else
    z=1;
  printf("%d",z);

  // *****Δεύτερος τρόπος με ternary*****
  /*O τριαδικός τελεστής (ternary) μπορεί να επιστραφεί και ως τιμή στη z.*/
  x=1; y=0;
  /* Στην ουσία αυτό που λέει η παρακάτω εντολή είναι ότι το z είναι ίσο με 0
  εάν το x<y και ίσο με το 1 εάν όχι.*/
  z = x<y ? 0 : 1;
  printf("\n%d",z);

  // *****Τρίτος τρόπος πάλι με ternary*****
  printf("\n%d",x<y?0:1); // μπορεί να μπει απευθείας και ως όρισμα στη printf.

return 0;
}
