/*Γράψτε ένα πρόγραμμα το οποίο θα λαμβάνει ως είσοδο τρείς(3) ακεραίους και θα
εκτυπώνει τον μεγαλύτερο από τους τρείς(3).
Να κατασκευαστεί το πρόγραμμα έτσι ώστε να μπορεί να δεχτεί και παραπάνω αριθμούς
για έλεγχο. Hint: int max*/

#include <stdio.h>

int main()
{
  int x;
  int max;

  printf("Δώσε τον 1ο ακέραιο: ");
  scanf("%d",&x);
  max = x;

  printf("Δώσε τον 2ο ακέραιο: ");
  scanf("%d",&x);
  if(x>max)
  max = x;

  printf("Δώσε τον 3ο ακέραιο: ");
  scanf("%d", &x);
  if(x>max)
  max = x;

  printf("Ο μεγαλύτερος είναι ο %d",max);

return 0;

}
