/*Δύο παίκτες ρίχνουν δύο ζάρια ο καθένας και νικάει ο παίκτης με το μεγαλύτερο
άθροισμα στα ζάρια. Γράψτε ένα πρόγραμμα σε C που θα ζητάει από το χρήστη
να εισάγει το αποτέλεσμα κάθε ζαριού κάθε παίκτη (έστω Α και Β) και να τυπώνει
στην οθόνη τον παίκτη που νίκησε.*/

#include <stdio.h>

int main()
{
  int ZariA1, ZariA2, ZariB1, ZariB2;
  int sum1, sum2;

  printf("Δώσε το αποτέλεσμα του πρώτου ζαριού του 1ου παίκτη: ");
  scanf("%d", &ZariA1);
  printf("Δώσε το αποτέλεσμα του δεύτερου ζαριού του 1ου παίκτη: ");
  scanf("%d", &ZariA2);
  printf("Δώσε το αποτέλεσμα του πρώτου ζαριού του 2ου παίκτη: ");
  scanf("%d", &ZariB1);
  printf("Δώσε το αποτέλεσμα του δεύτερου ζαριού του 2ου παίκτη: ");
  scanf("%d", &ZariB2);

  sum1 = ZariA1+ZariA2;
  sum2 = ZariB1+ZariB2;
  
  if(sum1>sum2)
  printf("Νίκησε ο 1ος παίκτης");
  else if(sum1<sum2)
  printf("Νίκησε ο 2ος παίκτης");
  else
  printf("Ισοπαλία!");

return 0;
}
