/* Τελεστές και Δομή Ελέγχου */
/*
ΔΟΜΗ ΕΛΕΓΧΟΥ if...else

Η δομή ελέγχου if εξετάζει κάποια συνθήκη η οποία αν ισχύει εκτελέι κάποιες
εντολές, αν όχι εκτελεί κάποιες άλλες εντολές. Έπειτα ακολουθούν τυχόν επόμενες
εντολές από τη δομή ελέγχου.
πχ.
[προηγουμενες εντολές]
if(συνθήκη)
  εντολή1;
[επόμενες εντολές]
Αν η συνθήκη1 είναι αληθής, τότε εκτελείτε η εντολή1, αν όχι τότε προχωράμε
στις [επόμενες εντολές]
Μπορούμε φυσικά να εκτελέσουμε και ένα μπλόκ κώδικα (πολλές εντολές) αντί μιας.
Αυτές πρέπει να τοποθετηθούν μέσα σε άγκιστρα {}

Συντακτικό:
if(συνθήκη)   <--εδώ δεν χρειάζεται ερωτηματικό, αλλιώς το λάθος θα είναι λογικό
                και ο μεταγλωττιστής δεν θα το καταλάβει.
{
  εντολή1;
  εντολή2;
  ......
}

Η εντολή else προστίθεται όταν θέλουμε να εκτελεστούν κάποιες συγκεριμένες
εντολές στη περίπτωση που δεν ισχύει η συνθήκη της if. Δεν θα συνεχίσει με τις
[επόμενες εντολές] αλλά θα εκτελεστεί πρώτα ότι υπάρχει στην else.
πχ
if(συνθήκη)
{
  εντολή1;
  εντολή2;
}
else
  εντολή3;



*/

#include <stdio.h>

int main()
{
  int x;
  int y;

  printf("Δώσε τον ακέραιο x: ");
  scanf("%d", &x);

  printf("Δώσε τον ακέραιο y: ");
  scanf("%d", &y);

  if(x<y)
    printf("\n%d<%d",x,y);

  if(x<=y)
    printf("\n%d<=%d",x,y);

  if(x==y)
    printf("\n%d==%d",x,y);

  if(x>=y)
    printf("\n%d>=%d",x,y);

  if(x>y)
    printf("\n%d>%d",x,y);

  return 0;
}
