/* Τελεστές και Δομή Ελέγχου */
/*
ΣΧΕΣΙΑΚΟΙ ΤΕΛΕΣΤΕΣ

Οι σχεσιακοί τελεστές συγκρίνουν δυο τιμές. Επιστρέφουν 1 όταν η σύγκριση
είναι αληθής(ισχύει η συνθήκη) και 0 όταν είναι ψευδής(δεν ισχύει η συνθήκη).
*****************************************
== ισο
> μεγαλύτερο
< μικρότερο
>= μεγαλύτερο ή ίσο
<= μικρότερο ή ίσο
!= διάφορον
*****************************************
πχ.
4+5==9 (Αληθές, επιστρέφει 1)
6*2==5+4+3 (Αληθές, επιστρέφει 1)
7>9 (Ψευδές, επιστρέφει 0)

z=(1<2); επιστρέφεται τιμή στο z=1 αφού το 1 είναι όντως < του 2

Αν και το 1 εδώ είναι το λογικό 1, δηλαδή σημαίνει Αληθές, δεν παύει να είναι
και μια ακέραια τιμή.

ΠΡΟΣΟΧΗ στο εξής: Εάν γνωρίζουμε ότι το x<y δεν ισχύει, τότε αυτόματα ισχύει
ότι x>=y.

Η πιο συνηθισμένη χρήση σχεσιακών τελεστών είναι με τη δομή ελέγχου if...else

Προτεραιότητα σχεσιακών τελεστών.
<, <=, >, >=
!=, ==
Ισχύει και εδώ, όπως και στους αριθμητικούς τελεστές, η από αριστερά προς τα
δεξιά προτεραιότητα όταν έχουμε τελεστές ίδιας προτεραιότητας.
πχ. (1<2)<(3>=2); επιστρέφει τελικά 0.

Τι επιστρέφει στο x ο παρακάτω κώδικας;
x=(x!=x)<(x==x);

Μεταγλώττισε και εκτέλεσε το παρακάτω πρόγραμμα.
Άλλαξε τις τιμές του x και y σε 2,1 και 2,2  για να δεις τι
επιστρέφεται στο z.

*/

#include <stdio.h>

int main()
{
  int x=1;
  int y=2;
  int z;

  printf("\nx=%d,y=%d", x,y);
  printf("\n==============");
  z=(x>y);
  printf("\nx>y:%d",z);

  z=(x>=y);
  printf("\nx>=y:%d",z);

  z=(x==y);
  printf("\nx==y:%d",z);

  z=(x<=y);
  printf("\nx<=y:%d",z);

  z=(x<y);
  printf("\nx<y:%d",z);

  z=(x!=y);
  printf("\nx!=y:%d",z);

  return 0;
}
