/* Τελεστές και Δομή Ελέγχου */
/*
ΔΟΜΗ ΕΛΕΓΧΟΥ if...else (εμφωλιασμένες if / nested if)

Η δομή ελέγχου  if στην ουσία είναι ΜΙΑ εντολή (εντολή συνθήκης). Μπορούμε να
έχουμε μια εντολή if μέσα σε μια άλλη όσες φορές θέλουμε. Αυτό ονομάζουμε
εμφωλιασμένες if.

*/

#include <stdio.h>

int main()
{
  int x;
  int y;

  printf("Δώσε τον ακέραιο x: ");
  scanf("%d",&x);
  printf("Δώσε τον ακέραιο y: ");
  scanf("%d",&y);

  if(x<y)
    printf("Ισχύει x<y");
/* πρόσεξε ότι το else εδώ είναι στην ουσία μια εντολή η οποία εκτελεί το μπλόκ
κώδικα εφόσον δεν ισχύει x<y */
  else
  {
    if(x==y)
      printf("Ισχύει x=y");
    else
      printf("Ισχύει x>y");
  }


return 0;
}
