/* Τελεστές και Δομή Ελέγχου */
/*
ΔΟΜΗ ΕΛΕΓΧΟΥ if...else

Η εντολή else προστίθεται όταν θέλουμε να εκτελεστούν κάποιες συγκεριμένες
εντολές στη περίπτωση που δεν ισχύει η συνθήκη της if. Δεν θα συνεχίσει με τις
[επόμενες εντολές] αλλά θα εκτελεστεί πρώτα ότι υπάρχει στην else και μετά οι
[επόμενες εντολές].
πχ
if(συνθήκη)
{
  εντολή1;
  εντολή2;
}
else
{
  εντολή3;
  εντολή4;
}

*/

#include <stdio.h>

int main()
{
  int x;

  printf("Δώστε έναν ακέραιο: ");
  scanf("%d", &x);

  if(x%2==0)
    printf("\nΟ αριθμός %d είναι άρτιος!",x);
  else
    printf("\nΟ αριθμός %d είναι περιττός!",x);

  return 0;
}
