/*Γράψτε ένα πρόγραμμα το οποίο θα ελέγχει και θα εκτυπώνει κατάλληλο μήνυμα
αν κάποιος είναι ανήλικος (<18) , ενήλικος (18..65), συνταξιούχος (>65)*/

#include <stdio.h>

int main()
{
  int age;
  char age_check[50];

printf("Δώσε την ηλικία σου(0-100): ");
  scanf("%d",&age);

  if(age<18)
    printf("Είσαι ανήλικος");
  else if(age>=18 && age<=65)
    printf("Είσαι ενήλικος");
  else if(age>65 && age<=100)
    printf("Είσαι συνταξιούχος");
  else
    printf("Λάθος τιμή!\nΤο πρόγραμμα τερματίστηκε."); // δεν το ζητάει η άσκηση.

}
