/* Τελεστές και Δομή Ελέγχου */
/*
Μοναδιαίοι τελεστές. ++ και --
Προσοχή στην προθεματική και μεταθεματική απόδοση τους.
++x , x++
Προτεραιότητα πράξεων (όταν δεν υπάρχει παρενθετοποίηση)
++,--
*,/,%
+,-
Όταν οι πράξεις έχουν την ίδια προτεραιότητα τότε γίνονται από αριστερά
προς τα δεξιά.
Συμβουλή: Πάντα να χρησιμοποιούμε παρενθέσεις για να μη κάνουμε λάθος ως προς
τη σειρά εκτέλεσης των πράξεων.

Βρείτε το αποτέλεσμα των παρακάτω παραστάσεων πριν τις εκτελέσετε.
*/

#include <stdio.h>

int main()
{
  int x=1;
  int y=1;

  printf("%d,%d", x++,++y);
  printf("\n%d,%d",x++,++y);
  printf("\n%d,%d", x++,++y);
  printf("\n%d,%d", x,y);
  return 0;
}
