/********** ΑΚΣΗΣΗ 2 (μέχρι Κυριακή 26.04.2020)************* 

Να βρεθούν τα αποτελέσματα: 
1) Το άθροισμα των στοιχείων της κύρια διαγωνίου 
2) Το άθροισμα των στοιχείων της δευτερεύουσας διαγωνίου

************************************************************/

#include <iostream>
#include <string>
#include <cstdio>

using namespace std;

int main()
{
    int a[5][5];
    int principal=0,secondary=0;
    int i,j;
     
    /*Αρχικοποίηση πίνακα με εμφωλιασμένες for
    με είσοδο από τον χρήστη (cin)*/
    
    for (i=0; i<5; i++){

        	for (j=0; j<5; j++){
        			cin >> a[i][j];
        		}
        	
    	}

    /* Διατρέχουμε τον πίνακα εκ νέου με εμφωλιασμένες for.
    Καλούμε δυο δομές ελέγχου για να βρούμε τα αθροίσματα των διαγωνίων: 
    κύριας(pricipal), δευτερεύουσας(secondary)
    Με τη πρώτη δομή ελέγχου if(i==j) διατρέχουμε μόνο τα σημεία
    0.0 1.1 2.2 3.3 κλπ (principal)
    Με τη δεύτερη δομή ελέγχου if(i+j==(5-1)) τα σημεία 4.0 3.1 2.2 κλπ. 
    (secondary) */
    
    for(i=0;i<5;++i){

    	for(j=0;j<5;++j){

			if(i==j){
				principal+=a[i][j];
				}
					
			if(i+j==(5-1)){
				secondary+=a[i][j];
				}
			}
    	}
		
    
    
    cout << "Principal Diagonal:" << principal << endl; 
    cout << "Secondary Diagonal:" << secondary << endl;	
    	
return 0;   
}

