/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*
Κατασκευάστε ένα πρόγραμμα που να προτρέπει το χρήστη να εισάγει 5 ακεραίους
αριθμούς και τους αποθηκεύει σε έναν μονοδιάστατο πίνακα 5 θέσεων.
Έπειτα υπολογίζει το άθροισμα και το τυπώνει στην οθόνη.

*/
#include <stdio.h>
#define SIZE 5

int main()
{
  int arr[SIZE];
  int i;
  int sum;

  // Αρχικοποίηση πίνακα με εισαγωγή αριθμών από τον χρήστη

  for(i=0; i<SIZE; i++)
  {
    printf("Εισάγετε τον %d-ο αριθμό: ",i+1);
    scanf("%d", &arr[i]);
  }

  // Υπολογισμός αθροίσματος
  sum=0; // αρχικοποίηση του αθροιστή/συσσωρευτή.
  for (i=0; i<SIZE; i++)
  {
    sum+=arr[i]; // ισοδύναμο με sum = sum + arr[i];
  }
  printf("Το άθροισμα είναι: %d", sum);

  return 0;
}
