/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*
Κατασκευάστε πρόγραμμα που:
α) Προτρέπει τον χρήστη να εισάγει έναν αριθμό Ν. Ο αριθμός Ν να είναι μεταξύ
1 και 20.

β) Έπειτα να διαβάζει από την είσοδο και να εισάγει Ν αριθμούς σε έναν
μονοδιάστατο πίνακα.

γ) Τέλος, να βρίσκει και να τυπώνει τον μέσο όρο των Ν αριθμών.

Επειδή δεν έχουμε μάθει ακόμη περί δυναμικής δέσμευσης μνήμης, δεσμεύουμε πάντα
τον μέγιστο αριθμό. Στη περίπτωση αυτή 20.

*/
#include <stdio.h>
#define SIZE 20

int main()
{
  int arr[SIZE];
  int i,sum;
  float mo;
  int N;

  /******************** Εισαγωγή του Ν από 2...20 **************************/
  do {
    printf("Εισάγετε το Ν (από 1-20): ");
    scanf("%d",&N);
  } while(N<1 || N>20);

  /*********************** Γέμισμα πίνακα *****************************/
  for(i=0; i<N; i++)
  {
    printf("Δώσε τον %d-o αριθμό: ", i+1);
    scanf("%d",&arr[i]);
  }

/*********************** Υπολογισμός αθροίσματος *****************************/
  sum = 0;
  for(i=0; i<N; i++)
  {
    sum+=arr[i];
  }

/*********************** Υπολογισμός μέσου όρου *****************************/
  mo = 0;
  mo=sum/(float)N; // τελεστής μετατροπής τύπου στο Ν για σωστή διαίρεση!
  printf("Ο μέσος όρος είναι: %f", mo); // προσδιοριστής τύπου %f για float.

  return 0;
}
