/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*
Άθροισμα αριθμών.
Το πόσους αριθμούς θα αθροίσουμε εξαρτάται από το i.

Τροποποιήστε το πρόγραμμα ώστε να υπολογίζει το γινόμενο τριών αριθμών.
Hint: προσοχή στην αρχικοποίηση του συσσωρευτή.

*/
#include <stdio.h>

int main()
{
  int i, sum, x;
  sum = 0; // σημαντική εντολή αρχικοποίησης του συσσωρευτή!

  for(i=1; i<=3; i++)
  {
    printf("Εισάγετε τον %d-o αριθμό: ", i);
    scanf("%d", &x);
    sum+=x; // ισούται με sum = sum + x;
  }

  printf("Το άθροισμα είναι: %d", sum);
  printf("\n");

  int prod = 1; // σημαντική εντολή αρχικοποίησης του συσσωρευτή!

  for(i=0; i<3; i++)
  {
    printf("Εισάγετε τον %d-o αριθμό: ", i+1);
    scanf("%d", &x);
    prod*=x; // ισούται με prod = prod * x;
  }

  printf("Το γινόμενο είναι: %d", prod);


  return 0;
}
