/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*

1) Χωρίς να εκτελέσετε το πρόγραμμα υπολογίστε πόσα Χ θα εκτυπώσει το πρόγραμμα
και σε ποια μορφή.

2) Τροποποιήστε το πρόγραμμα κατά βούληση ώστε να αλλάξετε το σχήμα.

3) Μετατρέψτε το πρόγραμμα σε ισοδύναμο ώστε να χρησιμοποιεί do..while αντί for.

*/
#include <stdio.h>

int main()
{
  int N;
  int i,j;

  N = 10;

  for(i=0; i<=N; i++)
  {
    for(j=i; j<=N; j++) // Προσοχή εδώ στο j=i. Το j θα ξεκινάει κάθε φορά από
    {                   // άλλη τιμή αφού το i θα αυξάνεται.
      printf("X");
    }
    printf("\n");
  }

  printf("\n");
  printf("\n");

  /********************** Μετατροπή σε do..while***************************/

  i=0;
  do
  {
    j=i;
    do
    {
      printf("X");
      j++;
    }while(j<=N);

    printf("\n");
    i++;
  }while(i<=N);


  return 0;
}
