/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*
Επανάληψη = Το κυριότερο χαρακτηριστικό του προγραμματισμού. Δηλαδή, η εκτέλεση
ενός τμήματος κώδικα πολλές φορές.

Στη γλώσσα C υπάρχουν τρεις τρόποι για να κάνουμε επανάληψη της εκτέλεσης ενός
τμήματος κώδικα:

1) Η εντολή for(...;...;...){...} στην οποία αναφέρουμε πόσες φορές θέλουμε να
εκτελεστεί ένα τμήμα κώδικα.
2) Η εντολή while(...){...}
3) Η εντολή do{...} while(...);

***************************** Εντολή for *****************************
for(αρχική; συνθήκη; βήμα)
{
  εντολές;
}

αρχική: εντολή αρχικοποίησης που τρέχει μια φορά μόνο
συνθήκη: γίνεται έλεγχος της συνθήκης. Συνήθως είναι σύγκριση τιμών
βήμα: όσο η συνθήκη είναι αληθής εκτελείται η αύξηση με το βήμα που έχουμε
ορίσει.
Αν η συνθήκη είναι ψευδής προχωράει στις επόμενες εντολές (φεύγει από τη for).




*/
#include <stdio.h>

int main()
{
  int i,x,j;
  int multi;

/***** 1ο παράδειγμα *****/

  printf("1ο παράδειγμα-εκτύπωση\n");
  for(i=1; i<=5; i++) // Το βήμα εδώ είναι (μοναδιαία) αύξηση κατά 1.
    printf("Hello\n");

/***** 2ο παράδειγμα *****/
  printf("\n2ο παράδειγμα-χρήση της μεταβλητής της for για εκτύπωση");
  for(i=1; i<=3; i++)
    printf("\n%d",i); /*  Εδώ χρησιμοποιούμε τη τιμή της μεταβλητής i που
                          τροποποιείται στην αύξηση και την εκτυπώνουμε */

/***** 3ο παράδειγμα *****/
  printf("\n\n3ο παράδειγμα-υπολογισμός");
  multi = 12; /* χρησιμεύει στην εύκολη αλλαγή του αριθμού αλλά και στη τελική
                εκτύπωση printf */

  for(i=1; i<=10; i++)
  {
    x = i*multi;  /*  Χρησιμοποιούμε τη τιμή της μεταβλητής i που υπάρχει στη
                      for για να κάνουμε έναν υπολογισμό.*/
    printf("\n%d*%d=%d",i,multi,x);
  } //χρησιμοποιούμε block κώδικα αφού οι εντολές είναι περισσότερες από μια.

  /***** 4ο παράδειγμα *****/
    printf("\n\n4ο παράδειγμα-μειωτική αύξηση");

    for(i=10; i>=1; i--) // το βήμα αυξάνεται μειωτικά!
    {                    // προσέχω την αλλαγή στην αρχική και τη συνθήκη.
      x = i*multi;
      printf("\n%d*%d=%d",i,multi,x);
    }

    /***** 5ο παράδειγμα *****/
    printf("\n\n5ο παράδειγμα-βήμα κατά δυο");

    for(i=1; i<=10; i+=2) // Αύξηση(βήμα) κατά δυο.
    {
      x = i*multi;
      printf("\n%d*%d=%d",i,multi,x);
    }

    /***** 6ο παράδειγμα *****/
    printf("\n\n6ο παράδειγμα-πολύπλοκη χρήση της for");
    /* μπορούμε να θέσουμε περισσότερες αρχικές, συνθήκες, βήματα ταυτόχρονα,
    με το κόμμα ως διαχωριστή*/
    for(i=0,j=0; i<5 && j<5; i++,j+=2) // προσέχω το λογικό AND στη συνθήκη.
      printf("\ni=%d,j=%d: ",i,j);

  return 0;
}
