/*ΔΟΜΕΣ ΕΠΑΝΑΛΗΨΗΣ*/
/*

1) Χωρίς να εκτελέσετε το πρόγραμμα υπολογίστε πόσα Χ θα εκτυπώσει και με ποια
μορφή.

2) Εκτελέστε το πρόγραμμα και τροποποιήστε το σχήμα κατά βούληση.

3) Μετατρέψτε το πρόγραμμα ώστε να χρησιμοποιεί την εντολή while, αντί της for.

*/
#include <stdio.h>

int main()
{
  int M,N;
  int i,j;

  M=10;
  N=20;

  for(i=0; i<=M; i++)
  {
    for(j=0; j<=N; j++)
    {
      printf("X");
    }
    printf("\n");
  }

  /************************** Μετατροπή σε while *****************************/
  printf("\n");
  printf("\n");

i=0;
while(i<=M)
{
  {
    j=0;
    while(j<=N)
    {
      printf("X");
      j++;
    }
  }
  printf("\n");
  i++;
}



  return 0;
}
