/*Απλή αναφορά στους ΜΟΝΟΔΙΑΣΤΑΤΟΥΣ ΠΙΝΑΚΕΣ*/

/*
Ένας πίνακας είναι μια σειρά από μεταβλητές ΙΔΙΟΥ ΤΥΠΟΥ αποθηκευμένες στη μνήμη.
Τον δηλώνουμε στο χώρο δήλωσης μεταβλητών ως εξής:
Τύπος_Δεδομένων Όνομα_Πίνακα[Πλήθος];

int array[5];

Τύπος δεδομένων: int
Όνομα πίνακα: array
Πλήθος ακέραιων μεταβλητών: 5
Θέσεις: array[0], array[1], array[2], array[3], array[4]
Προσοχή! μετράμε πάντα από το 0.
Οι array[0], array[1] κλπ είναι μεταβλητές. Όπως οι x,y,z.
Σε τι με εξυπηρετεί άμεσα ένα πίνακας; αν θέλω να δηλώσω σε ένα πρόγραμμα 500
μεταβλητές, δεν θα τις δηλώσω ως x,y,z,w...καληνύχτα. Θα δηλώσω έναν πίνακα με
500 θέσεις. int array[500];

Το μέγεθος ενός πίνακα είναι καλύτερο να το ορίζουμε με μια συμβολική σταθερά.
#define SIZE 3.
Έτσι μπορούμε να αλλάξουμε το μέγεθος εύκολα ανα πάσα στιγμή, αλλάζοντας μόνο
τον αριθμό.
*/

#include <stdio.h>
#define SIZE 3

int main()
{
  int arr[SIZE];
  int sum;

  arr[0] = 1;
  arr[1] = 3;
  arr[2] = 4;

  sum = arr[0] + arr[1] + arr[2];

  printf("%d+%d+%d=%d",arr[0],arr[1],arr[2],sum);

  return 0;
}
