/************** Άσκηση (μέχρι Κυριακή 26/04) ********************

Τροποποιήστε το πρόγραμμα ώστε να εμφανίζονται 
οι αριθμοί που δίνουμε σωστά ανά γραμμή και στήλη με ένα κενό ανάμεσα στις 
στήλες.
πχ 
1 1 
2 2 

****************************************************************/

#include <iostream>
#include <string>
#include <cstdio>
using namespace std;

int main()
{
    int i,j;
    int a[4][2];
    
    // Γέμισμα με εμφωλιασμένες for
    for(i=0; i<4; i++)
    {
        for(j=0; j<2; j++)
        cin >> a[i][j];
    }
    /* 
    Εμφάνιση δεδομένων με εμφωλιασμένες for
    και τροποποίηση της εξόδου ώστε να εμφανίζεται ως δισδιάστατος 
    πίνακας
    */
    
    for(i=0; i<4; i++)
    {
        for(j=0; j<2; j++)
        {
			cout<<""<<a[i][j]<<" ";
		}
		 cout<<endl;   
    }
    
    return 0;
}