/*********************************************
Πίνακες δυο διαστάσεων
Πρώτος αριθμός = γραμμές
Δεύτερος αριθμός = στήλες
Μπορεί να ζητηθεί στοιχείο πχ, 0.1 (μηδενική γραμμή, πρώτη στήλη)
Γεμίζουμε ή cout με δυο εμφωλιασμένες for. Μια για τις γραμμές, μια για 
τις στήλες.



***********************************************/
#include <iostream>
#include <string>
#include <cstdio>
using namespace std;

int main()
{
    int i,j;
    int a[4][2];
    
    // Γέμισμα με εμφωλιασμένες for
    for(i=0; i<4; i++)
    {
        for(j=0; j<2; j++)
        cin >> a[i][j];
    }
    // Εμφάνιση δεδομένων πάλι με εμφωλιασμένες for
    for(i=0; i<4; i++)
    {
        for(j=0; j<2; j++)
        cout << a[i][j];
    }
    
    return 0;
}

// Άσκηση (μέχρι Κυριακή 26/04)
/* Τροποποιήστε το παραπάνω πρόγραμμα ώστε να εμφανίζονται 
οι αριθμοί που δίνουμε σωστά ανά γραμμή και στήλη με ένα κενό ανάμεσα στις 
στήλες.
πχ 1 1 
    2 2 
*/
